CoreTemplates/AMI/kEpsilon/wall-resolved/system/createNonConformalCouples
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createNonConformalCouplesDict;
}

couples
(
    {
        patch1 rotaryRegion;
        patch2 rotaryRegion_slave;
    }
);
